app/controllers/actors_controller.rb

INSERT INTO "actors" ("dob", "name", "bio", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["dob", "1/1/1956"], ["name", "Heather Dunn"], ["bio", "Who Knows"], ["image_url", ""], ["created_at", "2016-05-07 02:22:47.181760"], ["updated_at", "2016-05-07 02:22:47.181760"]]
---
  def create_row
    at = Actor.new

    at.name = params[:name]
    at.dob = params[:dob]
    at.bio = params[:bio]
    at.image_url = params[:image_url]

    at.save

SELECT "actors".* FROM "actors"
---
  def index
    @actor_list = Actor.all

SELECT  "actors".* FROM "actors" WHERE "actors"."id" = ? LIMIT 1  [["id", 10]]
---
  def show
    @actor = Actor.find(params[:id])

SELECT  "actors".* FROM "actors" WHERE "actors"."id" = ? LIMIT 1  [["id", 10]]
---
  def edit_form
    @actor = Actor.find(params[:id])

SELECT  "actors".* FROM "actors" WHERE "actors"."id" = ? LIMIT 1  [["id", 10]]
UPDATE "actors" SET "bio" = ?, "updated_at" = ? WHERE "actors"."id" = ?  [["bio", "I don't know who this is"], ["updated_at", "2016-05-07 02:20:23.812772"], ["id", 10]]
---
  def update_row
    at = Actor.find(params[:id])

    at.name = params[:name]
    at.dob = params[:dob]
    at.bio = params[:bio]
    at.image_url = params[:image_url]

    at.save

SELECT  "actors".* FROM "actors" WHERE "actors"."id" = ? LIMIT 1  [["id", 10]]
DELETE FROM "actors" WHERE "actors"."id" = ?  [["id", 10]]
---
  def destroy
    at = Actor.find(params[:id])

    at.destroy