app/controllers/directors_controller.rb

SELECT "directors".* FROM "directors"
---
  def index
    @directors = Director.all

SELECT  "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT 1  [["id", 11]]
---
  def edit_form
    @director = Director.find(params[:id])

SELECT  "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT 1  [["id", 11]]
UPDATE "directors" SET "name" = ?, "updated_at" = ? WHERE "directors"."id" = ?  [["name", "John Onions"], ["updated_at", "2016-05-07 02:22:19.968815"], ["id", 11]]
---
  def update_row
    @director = Director.find(params[:id])
    @director.dob = params[:the_dob]
    @director.name = params[:the_name]
    @director.bio = params[:the_bio]
    @director.image_url = params[:the_image_url]

    @director.save

SELECT  "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "directors" WHERE "directors"."id" = ?  [["id", 3]]
---
  def destroy
    @director = Director.find(params[:id])
    @director.destroy

INSERT INTO "directors" ("dob", "name", "bio", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["dob", "1/1/1960"], ["name", "John Smith"], ["bio", "Who cares"], ["image_url", ""], ["created_at", "2016-05-07 02:22:06.304487"], ["updated_at", "2016-05-07 02:22:06.304487"]]
---
  def create_row
    @director = Director.new
    @director.dob = params[:dob]
    @director.name = params[:name]
    @director.bio = params[:bio]
    @director.image_url = params[:image_url]

    @director.save