app/controllers/movies_controller.rb

  def create_row
    @movie = Movie.new
    @movie.title = params[:title]
    @movie.year = params[:year]
    @movie.duration = params[:duration]
    @movie.description = params[:description]
    @movie.image_url = params[:image_url]

    @movie.save
---
INSERT INTO "movies" ("title", "year", "duration", "description", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def edit_form
    @movie = Movie.find(params[:id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]

  def update_row
    @movie = Movie.find(params[:id])
    @movie.title = params[:title]
    @movie.year = params[:year]
    @movie.duration = params[:duration]
    @movie.description = params[:description]
    @movie.image_url = params[:image_url]
    @movie.save
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "movies" SET "title" = ?, "duration" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "The Shawshank Redemption 2"], ["duration", 120], ["updated_at", "2016-05-07 02:19:14.329734"], ["id", 1]]